fonecmiddiplom120425/src/Catalogs/ВКМ_УведомленияТелеграмБоту/ВКМ_УведомленияТелеграмБоту.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ВКМ_УведомленияТелеграмБоту</name>
  <attributes>
    <name>Документ</name>
    <type>
      <types>DocumentRef.ВКМ_ОбслуживаниеКлиента</types>
    </type>
  </attributes>
  <attributes>
    <name>ВремяИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекстСообщения</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
</mdclass:Catalog>

fonecmiddiplom120425/src/CommonModules/ВКМ_ТелеграмHTTP/Module.bsl
#Область ПрограмныйИнтерфейс

Функция СтрокаJSON(ОбъектJSON) Экспорт
	
	ПараметрыЗаписи = Новый ПараметрыЗаписиJSON(, Символы.Таб);
	
	Запись = Новый ЗаписьJSON;
	Запись.УстановитьСтроку(ПараметрыЗаписи);
	ЗаписатьJSON(Запись, ОбъектJSON);
	
	Возврат Запись.Закрыть();
	
КонецФункции

Функция ОбъектJSON(СтрокаJSON) Экспорт
	
	Чтение = Новый ЧтениеJSON;
	Чтение.УстановитьСтроку(СтрокаJSON);
	ОбъектJSON = ПрочитатьJSON(Чтение);
	Чтение.Закрыть();
	
	Возврат ОбъектJSON;
	
КонецФункции

Функция ОтветJSON(Объект, КодСостояния = 200) Экспорт
	
	Ответ = Новый HTTPСервисОтвет(КодСостояния);
	
	Ответ.УстановитьТелоИзСтроки(СтрокаJSON(Объект));
	Ответ.Заголовки.Вставить("Content-Type", ТипКонтентаJSON());
	
	Возврат Ответ;
	
КонецФункции

Функция ПростойУспешныйОтвет() Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("Result", "OK");
	
	Возврат ОтветJSON(Результат);
	
КонецФункции

Функция ОтветОбОшибке(ИнформацияОбОшибке) Экспорт
	
	ЗаписьЖурналаРегистрации("HTTPСервисы.Ошибка", УровеньЖурналаРегистрации.Ошибка,,,
		ПодробноеПредставлениеОшибки(ИнформацияОбОшибке));
		
	Результат = Новый Структура;
	Результат.Вставить("Result", "Error");
	Результат.Вставить("ErrorTest", КраткоеПредставлениеОшибки(ИнформацияОбОшибке));
	
	Возврат ОтветJSON(Результат, 500);
	
КонецФункции

Процедура ЗаписьЛога(ИмяМетода, Запрос, Ответ) Экспорт
	
	ДокОбъект = Документы.ВКМ_ОбслуживаниеКлиента.СоздатьДокумент();
	ДокОбъект.ВКМ_ИмяМетода = ИмяМетода;
	ТелоЗапроса = Запрос.ПолучитьТелоКакСтроку();
	Попытка
			ТелоЗапроса = СтрокаJSON(ОбъектJSON(ТелоЗапроса));
	Исключение
	КонецПопытки;
	ДокОбъект.ВКМ_ТелоЗапроса = ТелоЗапроса;
	ДокОбъект.ВКМ_КодСостояния = Ответ.КодСостояния;
	ДокОбъект.Дата = ТекущаяДатаСеанса();
	
	ДокОбъект.Записать();
	
КонецПроцедуры

Процедура ОтправкаСообщенияДляРегламентогоЗадания() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ВКМ_УведомленияТелеграмБоту.Ссылка,
		|	ВКМ_УведомленияТелеграмБоту.Документ,
		|	ВКМ_УведомленияТелеграмБоту.ТекстСообщения,
		|	ВКМ_УведомленияТелеграмБоту.ПометкаУдаления
		|ИЗ
		|	Справочник.ВКМ_УведомленияТелеграмБоту КАК ВКМ_УведомленияТелеграмБоту
		|ГДЕ
		|	ВКМ_УведомленияТелеграмБоту.ПометкаУдаления = ЛОЖЬ";
	
	РезультатЗапроса = Запрос.Выполнить();

	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		Если ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.ТекстСообщения) Тогда
		
			РезультатОтправки = ОтправкаСообщенияВТелеграм(ВыборкаДетальныеЗаписи.ТекстСообщения);
			
			Если СтрНайти(РезультатОтправки, "ok", , 1, 1) < 10 И СтрНайти(РезультатОтправки, ":true", , 1, 1) < 10 Тогда
				
				ПометкаЭлементаНаУдаление = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
				ПометкаЭлементаНаУдаление.Удалить();
		
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры


Функция ОтправкаСообщенияВТелеграм(ТекстСообщения) Экспорт
	
	Чат_Id = Константы.ВКМ_ИдентификаторГруппыДляОповещения.Получить();
	Токен = Константы.ВКМ_ТокенУправленияТелеграмБотом.Получить();
	Ресурс = "bot" + Токен + "/sendMessage?chat_id=" + Чат_Id + "&text=" + ТекстСообщения;
	
	
	
	HTTPСоединение = Новый HTTPСоединение("api.telegram.org", , , , , , Новый ЗащищенноеСоединениеOpenSSL());
	HTTPЗапрос = Новый HTTPЗапрос(Ресурс);
	HTTPОтвет = HTTPСоединение.Получить(HTTPЗапрос);
	
	ЧтениеJSON = Новый ЧтениеJSON();
	СтрокаОтвет = HTTPОтвет.ПолучитьТелоКакСтроку();
	ЧтениеJSON.УстановитьСтроку(СтрокаОтвет);
		
	СоответствиеОтвет = ПрочитатьJSON(ЧтениеJSON, Истина);
	
	Возврат СтрокаОтвет;
		
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ТипКонтентаJSON()
	Возврат "application/json";	
КонецФункции

#КонецОбласти
